#include <iostream>
using namespace std;

int main() {
    int X, Y, Z;
    
    cout << "Введите три числа X, Y, Z: ";
    cin >> X >> Y >> Z;
    

    bool a = (X % 2 != 0) && (Y % 2 != 0);
    cout << "а) Оба числа нечетные: " << (a ? "истина" : "ложь") << endl;
    

    bool b = (X < 20 && Y >= 20) || (X >= 20 && Y < 20);
    cout << "б) Только одно число меньше 20: " << (b ? "истина" : "ложь") << endl;
    

    bool c = (X == 0) || (Y == 0);
    cout << "в) Хотя бы одно число равно нулю: " << (c ? "истина" : "ложь") << endl;
    

    bool d = (X < 0) && (Y < 0) && (Z < 0);
    cout << "г) Все числа отрицательные: " << (d ? "истина" : "ложь") << endl;
    

    bool x5 = (X % 5 == 0);
    bool y5 = (Y % 5 == 0);
    bool z5 = (Z % 5 == 0);
    bool e = (x5 && !y5 && !z5) || (!x5 && y5 && !z5) || (!x5 && !y5 && z5);
    cout << "д) Только одно число кратно 5: " << (e ? "истина" : "ложь") << endl;
    

    bool f = (X > 100) || (Y > 100) || (Z > 100);
    cout << "е) Хотя бы одно число больше 100: " << (f ? "истина" : "ложь") << endl;
    
    return 0;
}